package com.example.asus.richmans;

import android.content.Context;
import android.os.Bundle;
import android.support.v7.app.AppCompatActivity;
import android.support.v7.widget.DividerItemDecoration;
import android.support.v7.widget.LinearLayoutManager;
import android.support.v7.widget.RecyclerView;

import java.util.ArrayList;
import java.util.List;

import uk.co.chrisjenx.calligraphy.CalligraphyContextWrapper;

public class LearnPageActivity extends AppCompatActivity {

    RecyclerView recTutorials;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_learn_page);

        recTutorials = (RecyclerView) findViewById(R.id.rec_tutorials);
        List<Tutorial> tutorials = new ArrayList<>();

        //sample init
        Tutorial tutorial1 = new Tutorial();
        tutorial1.name = "بازی که بازی نیست";
        tutorial1.explain = "دوستانی که اپلیکیشن بازی ثروتمندان را دانلود کردید ضمن اینکه خیلی خوشحالم از همراهی شما و بهتون تبریک میگم که به فکر سر و سامان دادن به زندگی خودتون هستید، بذارید همین اول یک موضوعی را خیلی محکم و قطعی خدمت شما بزرگواران عرض کنم و اون اینه که نتیجه ای که شما از بازی ثروتمندان میتونید بگیرید ارتباط بسیار محکم و مستقیمی با نحوه انجام درست بازی داره.پس اول از همه وقت بذارید و تمام اصول بازی را یاد بگیرید و بعد برید سراغ بازی.\n" +
                "من به شخصه افراد زیادی را می شناسم که با کار کردن روی ذهنشون و ثروتمند کردن اون، تونستن به ثروت و درآمد بسیار بالایی برسند و مطمئنم که این راه، راهی است که همه میتوننن ازش نتیجه بگیرند و ذهن، نعمت بی نظیری است که خدای مهربان در وجود همه ما قرار داده است.\n" +
                "نتیجه سالها مطالعه و به کارگیری و آزمایش کردن اصول موفقیت برای من این بوده است که هر فرد برای رسیدن به موفقیت و به دست آوردن هر آنچه که در زندگی خودش میخواد فقط و فقط به دو تا ابزار نیاز داره: ذهن تربیت شده و زمان.\n" +
                "جالب اینجاست که من و همه شماهایی که الان دارید این متن را می خوانید هر دو تای این ابزارها را در اختیار داریم چرا که فعلا در قید حیاتیم و هر انسان زنده ای دارای ذهن هست و همینطور تا موعد مشخصی در این دنیای مادی زمان در اختیار وی خواهد بود.\n" +
                "نکته ای که در اینجا میخواهم متذکر بشوم اینست که پرورش دادن ذهن کار چندان آسانی نیست ولی واقعا تنها کاری که برای پیمودن مسیر موفقیت باید انجام بدید همین یک کاره!!!! پس ارزششو داره که همه انرژی و توان خودتونو صرف کنید تا روی پرورش ذهن خودتون کار کنید.زمانی که ذهن شما برنامه ریزی مجدد شد و افکار و باورهای قدرتمند و پیش برنده در آن ریشه دواند، ذهنیت شما نسبت به مسائل و اتفاقات پیرامونتون عوض میشه و به این ترتیب جهان هستی مطابق با ذهنیت جدیدتان با شما برخورد و تعامل میکنه.\n" +
                "بازی ثروتمندان یک گام بزرگ در مسیر ثروتمندتر کردن ذهن شماست.اصول و چهارچوب اولیه این بازی توسط خانم استر هیکس طراحی شده و در کتاب جذب پول به همراه چند تمرین دیگه آورده شده است.من در طی چند مرحله استفاده از این بازی روشهایی را برای بهبود آن پیدا کردم و در هر سری از انجام بازی یک روش را امتحان کردم تا به ترکیبی از بهترین روش که بالاترین بازدهی را داشت رسیدم و بعد همه اصول مربوط به روشهای درست انجام این تمرین بسیار قدرتمند را در اپلیکیشن بازی ثروتمندان به کار بردم.\n" +
                "شما برای اینکه بتونید ذهن خودتونو پرورش بدید و تقویت کنید اول از همه لازمه که اونو خوب و عالی بشناسید و بتوانید نسبت به  همه زوایای ذهن مثل کف دستتون شناخت و تسلط پیدا کنید.این کار با یه کم مطالعه و بعد بیشتر با انجام تمرین و انجام کار عملی ممکن است.ما در بخش آموزش همین اپلیکیشن سعی می کنیم شما به شناخت اولیه در این خصوص برسید و بعد با انجام تمرینات عملی این پروسه را تکمیل کنید. \n";
        tutorial1.image = R.drawable.tutolial_defult;
        tutorials.add(tutorial1);


        Tutorial tutorial2 = new Tutorial();
        tutorial2.name = "قواعد بازی";
        tutorial2.explain = "در بازی ثروتمندان شما یک حساب مالی به\u200Cصورت ذهنی دارید که هرروز مبلغی در آن حساب واریز می\u200Cگردد و شما به\u200Cصورت ذهنی آن را خرج می\u200Cکنید.این موضوع به\u200Cمرور ذهن شمارا به داشتن ثروت زیاد عادت می\u200Cدهد و همین موضوع باعث می\u200Cشود ذهنتان راه\u200Cهایی بیابد برای ورود پول به زندگی شما.( به همین سادگی!! )\n" +
                "\n" +
                "در انجام بازی ثروتمندان حتماً باید این قوانین را رعایت کنید:\n" +
                "•\tبا توجه به وضعیت مالی خودتون مبلغی را به\u200Cعنوان مبلغ پایه در نظر بگیرید که میزان واریز پول را بر اون مبنا قرار بدیم:\n" +
                "        \n" +
                "                                            مبلغ پایه * عدد روز = مبلغ واریزی\n" +
                "به\u200Cطور مثال اگر مبلغ پایه شما یک\u200Cمیلیون تومان باشد، شما در روز اول یک\u200Cمیلیون، در روز دوم دو میلیون و در روز سوم سه میلیون و... به\u200Cحساب ذهنیتون واریز میشه.\n" +
                "اگر مبلغ پایه شما 500 هزار تومان باشد، در روز اول 500 هزار تومان، در روز دوم یک\u200Cمیلیون تومان(000/500 * 2) و در روز سوم 1.5 میلیون تومان (000/500 * 3 ) و ... به\u200Cحساب شما واریز میشه.\n" +
                "اگه به ریاضیات و حساب\u200Cوکتاب علاقه\u200Cای ندارید، جای نگرانی نیست شما فقط مبلغ پایه را مشخص می\u200Cکنید و بقیه محاسبات را نرم\u200Cافزار خودش انجام میده.\n" +
                "نکته خیلی مهم در انتخاب مبلغ پایه این است که این مبلغ نباید برای شما خیلی دور از ذهن باشد مثلاً اگر شما ماهی یک\u200Cمیلیون تومان درآمد دارید، مبلغ پایه شما میتونه 100 هزار تومان باشه.به\u200Cطورکلی پیشنهاد ما برای انتخاب مبلغ پایه، یک\u200Cدهم درآمد ماهانه شماست.\n" +
                "\n" +
                "•\tهر مبلغی که در روز به\u200Cحساب ذهنی شما واریز میشه باید همون روز به\u200Cطور کامل خرج بشه و نمی\u200Cتوانید بخشی از اون را به\u200Cروزهای بعد منتقل کنید.\n" +
                "•\tاگر به هر دلیلی یک روز یادتون بره که بازی را انجام بدید باید بازی را مجدداً از روز اول شروع کنید.\n" +
                "•\tاگر به هر دلیلی مقداری از پولی که در حساب داشتید، تا آخر اون روز خرج نشود باید بازی را مجددا از روز اول شروع کنید.\n" +
                "•\tشما مجاز به پس انداز کردن پول نیستید و همه موجودی حساب در همان روز خرج می شود.\n" +
                "•\tشما مجاز به پرداخت بدهی هاتون با موجودی حساب ذهنیتون نیستید چه بدهی به افراد باشد و چه اقساط وامهای بانکی و ...\n" +
                "•\tشما مجاز به خرید چیزی با هدف فروش مجدد اون و کسب سود نیستید.مثلا سکه طلا و دلار و ... که با هدف کسب سود خریداری گردد.\n" +
                "•\tاگر می\u200Cخواهید با موجودی حساب ذهنیتون به کسی یا به خیریه\u200Cای کمک کنید می\u200Cتوانید این کار را انجام دهید منتها مواظب باشید که به واقعیت نزدیک باشد یعنی  کمکی را انجام دهید که اگر واقعاً پول داشته باشید آن کار را انجام دهید.\n" +
                "•\tبهترین کار اینست که در اوقات فراغتی که در طی روز در اختیار دارید خریدهایتان را انجام دهید و آخر شب با مرور خرید ها و تکمیل آنها بخوابید.\n" +
                "•\tسعی کنید در هر روز تعداد خریدهایتان حداقل سه مورد باشد و کل موجودی را بابت خرید یک چیز ندهید.\n" +
                "•\tخریدی که بدون تصویر سازی ذهنی باشد ارزش چندانی ندارد پس حتما قبل از خرید تصور کنید که مبلغ موجودی را در کارت بانکی یا حساب جاری خود دارید و فیلم نحوه خرید کردنتان را با جزئیات بالا ( فضای لوکس فروشگاه، احترام بالای فروشنده به شما بعنوان یک مشتری ویژه، تحویل گرفتن کالا در فروشگاه یا درب منزل، لحظه پرداخت بهای کالا که لبخند زیبایی برلبتان است و...) در ذهنتان به تصویر بکشید.\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "از شما می خوام حتما برای انجام بازی وقت لازم را در روز اختصاص دهید و هیچ گاه برای رفع تکلیف و از سر باز کردن خرید نکنید.هر خرید نیاز به تصویر سازی چند دقیقه ای دارد و همینطور در آخر شب و قبل از خواب، فیلم مربوط به کل خریدهای روز را مرور  کنید و با احساس عالی به خواب  بروید.\n";
        tutorial2.image = R.drawable.tutolial_defult;
        tutorials.add(tutorial2);

        LinearLayoutManager linearLayoutManager = new LinearLayoutManager(this);
        recTutorials.setLayoutManager(linearLayoutManager);
        recTutorials.setHasFixedSize(true);
        recTutorials.setAdapter(new TutorialRecyclerAdapter(getApplicationContext(), tutorials));
        DividerItemDecoration itemDecor = new DividerItemDecoration(this, DividerItemDecoration.VERTICAL);
        recTutorials.addItemDecoration(itemDecor);
    }

    @Override
    protected void attachBaseContext(Context newBase) {
        super.attachBaseContext(CalligraphyContextWrapper.wrap(newBase));
    }
}
